"use client";
import Header from "@/components/dashboard/header/Header";
import React, { useEffect, useState } from "react";
import ClientSections from "@/components/dashboard/clients/ClientSections";
import { Message } from "@/components/dashboard/message/Message";


function page({ params }) {
  const [lang, setLang] = useState(document.querySelector("html").lang);

  useEffect(() => {
    let htmllang = document.querySelector("html").lang;
    setLang(htmllang);
  }, [lang]);

  useEffect(() => {
    let navLst = window.location.href.split("/");
    let links = document.querySelectorAll(".secLinks a");
    links.forEach((e) => {
      e.getAttribute("label") === navLst[7]
        ? e.classList.add("active")
        : links[0].classList.add("active");
    });
  }, []);
  
  const handelCopy = (e) => {
    let tag = e.target.tagName;
    if (tag === "svg") {
      navigator.clipboard.writeText(
        e.target.parentElement.previousElementSibling.innerText
      );
      Message("تم النسخ");
    } else {
      navigator.clipboard.writeText(e.target.previousElementSibling.innerText);
      Message("تم النسخ");
    }
  };
  return (

      <div className="flex flex-col h-[100vh]">
        <Header title={"العملاء"} crumb={"ايلا ياسر"} />
        <div className="setcNav">
          <ClientSections ClientId={params.clientId} />
          <div className="clientContainer">
            <h1 className="hd1">
              {lang === "ar" ? "البيانات الشخصية" : "Profile"}
            </h1>
            <div className="profileData">
              <img src="/media/Face 2.png" alt="" />
              <div className="data">
                <span>ايلا ياسر</span>
                <a href="##">
                  <svg
                    width="24"
                    height="25"
                    viewBox="0 0 24 25"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M9 12.98C9 13.2452 8.89464 13.4996 8.70711 13.6871C8.51957 13.8746 8.26522 13.98 8 13.98C7.73478 13.98 7.48043 13.8746 7.29289 13.6871C7.10536 13.4996 7 13.2452 7 12.98C7 12.7148 7.10536 12.4604 7.29289 12.2729C7.48043 12.0853 7.73478 11.98 8 11.98C8.26522 11.98 8.51957 12.0853 8.70711 12.2729C8.89464 12.4604 9 12.7148 9 12.98ZM13 12.98C13 13.2452 12.8946 13.4996 12.7071 13.6871C12.5196 13.8746 12.2652 13.98 12 13.98C11.7348 13.98 11.4804 13.8746 11.2929 13.6871C11.1054 13.4996 11 13.2452 11 12.98C11 12.7148 11.1054 12.4604 11.2929 12.2729C11.4804 12.0853 11.7348 11.98 12 11.98C12.2652 11.98 12.5196 12.0853 12.7071 12.2729C12.8946 12.4604 13 12.7148 13 12.98ZM17 12.98C17 13.2452 16.8946 13.4996 16.7071 13.6871C16.5196 13.8746 16.2652 13.98 16 13.98C15.7348 13.98 15.4804 13.8746 15.2929 13.6871C15.1054 13.4996 15 13.2452 15 12.98C15 12.7148 15.1054 12.4604 15.2929 12.2729C15.4804 12.0853 15.7348 11.98 16 11.98C16.2652 11.98 16.5196 12.0853 16.7071 12.2729C16.8946 12.4604 17 12.7148 17 12.98Z"
                      fill="#212121"
                    />
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M22.75 12.98C22.75 7.04298 17.937 2.22998 12 2.22998C6.063 2.22998 1.25 7.04298 1.25 12.98C1.25 14.698 1.654 16.325 2.372 17.767C2.479 17.982 2.502 18.202 2.452 18.387L1.857 20.613C1.449 22.137 2.843 23.531 4.367 23.123L6.593 22.527C6.80252 22.4773 7.02295 22.5058 7.213 22.607C8.69997 23.3475 10.3388 23.732 12 23.73C17.937 23.73 22.75 18.917 22.75 12.98ZM12 3.72998C14.4533 3.72998 16.806 4.70453 18.5407 6.43924C20.2754 8.17395 21.25 10.5267 21.25 12.98C21.25 15.4332 20.2754 17.786 18.5407 19.5207C16.806 21.2554 14.4533 22.23 12 22.23C10.5711 22.2322 9.16119 21.9018 7.882 21.265C7.3648 21.0004 6.76878 20.9339 6.206 21.078L3.979 21.674C3.88574 21.6989 3.78758 21.6988 3.69437 21.6737C3.60117 21.6486 3.51619 21.5995 3.448 21.5312C3.3798 21.4629 3.33077 21.3779 3.30585 21.2846C3.28092 21.1914 3.28098 21.0932 3.306 21L3.902 18.774C4.04604 18.2112 3.97954 17.6152 3.715 17.098C3.0782 15.8188 2.74782 14.4089 2.75 12.98C2.75 10.5267 3.72455 8.17395 5.45926 6.43924C7.19397 4.70453 9.54675 3.72998 12 3.72998Z"
                      fill="#212121"
                    />
                  </svg>
                  محادثة
                </a>
                <span>+96522325000</span>
                <div className="copy" onClick={handelCopy}>
                  <svg
                    width="25"
                    height="25"
                    viewBox="0 0 25 25"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M11.6 23.73H7.4C3.49 23.73 1.75 21.99 1.75 18.08V13.88C1.75 9.96998 3.49 8.22998 7.4 8.22998H11.6C15.51 8.22998 17.25 9.96998 17.25 13.88V18.08C17.25 21.99 15.51 23.73 11.6 23.73ZM7.4 9.72998C4.3 9.72998 3.25 10.78 3.25 13.88V18.08C3.25 21.18 4.3 22.23 7.4 22.23H11.6C14.7 22.23 15.75 21.18 15.75 18.08V13.88C15.75 10.78 14.7 9.72998 11.6 9.72998H7.4Z"
                      fill="#979797"
                    />
                    <path
                      d="M17.6 17.73H16.5C16.09 17.73 15.75 17.39 15.75 16.98V13.88C15.75 10.78 14.7 9.72998 11.6 9.72998H8.5C8.09 9.72998 7.75 9.38998 7.75 8.97998V7.87998C7.75 3.96998 9.49 2.22998 13.4 2.22998H17.6C21.51 2.22998 23.25 3.96998 23.25 7.87998V12.08C23.25 15.99 21.51 17.73 17.6 17.73ZM17.25 16.23H17.6C20.7 16.23 21.75 15.18 21.75 12.08V7.87998C21.75 4.77998 20.7 3.72998 17.6 3.72998H13.4C10.3 3.72998 9.25 4.77998 9.25 7.87998V8.22998H11.6C15.51 8.22998 17.25 9.96998 17.25 13.88V16.23Z"
                      fill="#979797"
                    />
                  </svg>
                  نسخ
                </div>
                <span>gmail@gmail.com</span>
                <div className="copy" onClick={handelCopy}>
                  <svg
                    width="25"
                    height="25"
                    viewBox="0 0 25 25"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M11.6 23.73H7.4C3.49 23.73 1.75 21.99 1.75 18.08V13.88C1.75 9.96998 3.49 8.22998 7.4 8.22998H11.6C15.51 8.22998 17.25 9.96998 17.25 13.88V18.08C17.25 21.99 15.51 23.73 11.6 23.73ZM7.4 9.72998C4.3 9.72998 3.25 10.78 3.25 13.88V18.08C3.25 21.18 4.3 22.23 7.4 22.23H11.6C14.7 22.23 15.75 21.18 15.75 18.08V13.88C15.75 10.78 14.7 9.72998 11.6 9.72998H7.4Z"
                      fill="#979797"
                    />
                    <path
                      d="M17.6 17.73H16.5C16.09 17.73 15.75 17.39 15.75 16.98V13.88C15.75 10.78 14.7 9.72998 11.6 9.72998H8.5C8.09 9.72998 7.75 9.38998 7.75 8.97998V7.87998C7.75 3.96998 9.49 2.22998 13.4 2.22998H17.6C21.51 2.22998 23.25 3.96998 23.25 7.87998V12.08C23.25 15.99 21.51 17.73 17.6 17.73ZM17.25 16.23H17.6C20.7 16.23 21.75 15.18 21.75 12.08V7.87998C21.75 4.77998 20.7 3.72998 17.6 3.72998H13.4C10.3 3.72998 9.25 4.77998 9.25 7.87998V8.22998H11.6C15.51 8.22998 17.25 9.96998 17.25 13.88V16.23Z"
                      fill="#979797"
                    />
                  </svg>
                  نسخ
                </div>
              </div>
            </div>
            <div className="dataCard">
              <div className="dC">
                <span>رقم البطاقة المدنية</span>
                <p>5321468798421321564</p>
              </div>
              <div className="dC">
                <span> العمر </span>
                <p>25 عاما</p>
              </div>
              <div className="dC">
                <span> الوزن </span>
                <p> 45 كجم</p>
              </div>
              <div className="dC">
                <span> الطول </span>
                <p>150 سم</p>
              </div>
              <div className="dC">
                <span> الحالة الاجتماعية </span>
                <p>عزباء</p>
              </div>
              <div className="dC">
                <span> الوظيفة </span>
                <p>دكتوره اسنان</p>
              </div>
              <div className="dC">
                <span> الجنسية </span>
                <p>كويتية</p>
              </div>
            </div>
            <div className="rowsData">
              <div className="dC dc2">
                <span>
                  {" "}
                  هل تعانى من اى مشكلة ممكن ان تعيق الخطة التجميلية؟{" "}
                </span>
                <p>
                  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم
                  توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا
                  النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف
                  التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات
                  يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن
                  يبدو
                </p>
              </div>

              <div className="dC dc2">
                <span> ما هو السبب وراء رغبتك فى التعامل مع مسؤل تجميلى؟ </span>
                <p>
                  ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر
                  للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم
                  عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه
                  التصميم فيظهر بشكل لا يليق.
                </p>
              </div>
              <div className="dataCard">
                <div className="dC">
                  <span>كيف تعرفتى على المسؤل التجميلى؟ </span>
                  <p>اصدقاء</p>
                </div>
                <div className="dC">
                  <span> ما هى مخاوفك </span>
                  <p>تتعلق بالالم</p>
                </div>
                <div className="dC">
                  <span> هل انتى مستعدة وتقبلين التتغير </span>
                  <p> نعم </p>
                </div>
              </div>
              <div className="dC dc2">
                <span> ما هى جديتك فى تطبيق المخطط؟ </span>
                <p>جدى للغايه</p>
              </div>
            </div>
          </div>
        </div>
      </div>

  );
}

export default page;
